---
kind: method
id: M:Autodesk.Revit.UI.IExternalApplication.OnStartup(Autodesk.Revit.UI.UIControlledApplication)
source: html/f9f68666-4d80-b5a6-858c-735e289dc407.htm
---
# Autodesk.Revit.UI.IExternalApplication.OnStartup Method

Implement this method to execute some tasks when Autodesk Revit starts.

## Syntax (C#)
```csharp
Result OnStartup(
	UIControlledApplication application
)
```

## Parameters
- **application** (`Autodesk.Revit.UI.UIControlledApplication`) - A handle to the application being started.

## Returns
Indicates if the external application completes its work successfully.